app/components/drawing_component.rb

SELECT "drawings".* FROM "drawings" WHERE "drawings"."id" = 9 LIMIT 1
---
  def initialize(num:)
    @drawing = Drawing.find(num)