app/views/pages/home.html.erb

SELECT "drawings"."id" FROM "drawings"
SELECT 1 AS one FROM "drawings" LIMIT 1
---
      <%# <% num = Drawing.count_by_sql("SELECT COUNT(*) FROM drawings") %>
    <% if Drawing.exists? %>
      <%=render(DrawingComponent.new(num: Drawing.pluck(:id).sample ))%>
      <%=render(DrawingComponent.new(num: Drawing.pluck(:id).sample ))%>
      <%=render(DrawingComponent.new(num: Drawing.pluck(:id).sample ))%>