app/controllers/drawings_controller.rb

  def index
    @drawings = Drawing.all
---
SELECT "drawings".* FROM "drawings"

  def create
    Rails.logger.info "drawing_params: #{drawing_params.inspect}"
    Rails.logger.info "artist: #{current_user.display_name}"
    Rails.logger.info "slack id: #{current_user.slack_id}"

    @drawing = Drawing.new(drawing_params.merge(
                             artist: current_user.display_name,
                             slack_id: current_user.slack_id
                           ))

    if @drawing.save
---
INSERT INTO "drawings" ("artist", "created_at", "updated_at") VALUES ('m', '2025-07-09 17:19:36.959349', '2025-07-09 17:19:36.959349') RETURNING "id"

  def update
    if @drawing.update(drawing_params)
---
UPDATE "drawings" SET "updated_at" = '2025-07-09 17:19:37.022172' WHERE "drawings"."id" = 6

  def destroy
    @drawing.destroy!
---
DELETE FROM "drawings" WHERE "drawings"."id" = 2

  def set_drawing
    @drawing = Drawing.find(params[:id])
---
SELECT "drawings".* FROM "drawings" WHERE "drawings"."id" = 3 LIMIT 1